konf/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбоненсткаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

konf/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

konf/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
		ИзменитьВидимостьРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
		ИзменитьВидимостьРеквизитов();
КонецПроцедуры  


&НаСервере
Процедура ИзменитьВидимостьРеквизитов();  
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
	
		Элементы.ВКМ_АбоненсткаяПлата.Видимость = Истина; 
		Элементы.ВКМ_НачалоДействия.Видимость = Истина;
		Элементы.ВКМ_ОкончаниеДействия.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
	Иначе  
		Объект.ВКМ_АбоненсткаяПлата = Неопределено; 
		Объект.ВКМ_НачалоДействия = Неопределено;
		Объект.ВКМ_ОкончаниеДействия = Неопределено;
		Объект.ВКМ_СтоимостьЧаса = Неопределено;

		Элементы.ВКМ_АбоненсткаяПлата.Видимость = Ложь; 
		Элементы.ВКМ_НачалоДействия.Видимость = Ложь;
		Элементы.ВКМ_ОкончаниеДействия.Видимость = Ложь; 
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
	КонецЕсли;

	
КонецПроцедуры
